stressTest/get-products.yml
config:
  target: "http://localhost:3000"
  phases:
    # - duration: 60
    #   arrivalRate: 1
    #   name: 1 request per second
    # - duration: 60
    #   arrivalRate: 10
    #   name: 10 request per second
    # - duration: 60
    #   arrivalRate: 100
    #   name: 100 request per second
    # - duration: 60
    #   arrivalRate: 1000
    #   name: 1000 request per second
scenarios:
  - name: "get products 1"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 199432
            count: 5
  - name: "get products 2"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 99999
            count: 5
  - name: "get products 3"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 53535
            count: 5
  - name: "get products 4"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 153432
            count: 5
  - name: "get products 5"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 112432
            count: 5
  - name: "get products 6"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 23434
            count: 5
  - name: "get products 7"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 74343
            count: 5
  - name: "get products 8"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 183432
            count: 5
  - name: "get products 9"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 140343
            count: 5
  - name: "get products 10"
    flow:
      - get:
          url: "/products/list"
          qs:
            page: 197575
            count: 5